# Pandas
- dataframe

In [1]:
import pandas as pd
import numpy as np

## Dataframe creation

In [2]:
user_data = {
    "MarksA":np.random.randint(1,100,10),
    "MarksB":np.random.randint(1,100,10),
    "MarksC":np.random.randint(1,100,10)
}

In [9]:
df = pd.DataFrame(user_data,dtype="float32")

In [10]:
df

   MarksA  MarksB  MarksC
0    24.0    63.0    87.0
1    17.0    89.0    10.0
2    38.0    74.0    29.0
3    74.0    81.0    64.0
4    28.0    74.0    15.0
5     2.0    54.0    53.0
6    27.0    26.0    83.0
7    90.0    48.0    12.0
8     4.0    20.0    50.0
9    95.0    30.0    49.0

In [11]:
# by default top 5 enteries
df.head()

   MarksA  MarksB  MarksC
0    24.0    63.0    87.0
1    17.0    89.0    10.0
2    38.0    74.0    29.0
3    74.0    81.0    64.0
4    28.0    74.0    15.0

In [12]:
#columns
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [15]:
# saving to csv
df.to_csv("marks.csv",index=False)

In [16]:
# reading
data = pd.read_csv("marks.csv")

In [17]:
data

   MarksA  MarksB  MarksC
0    24.0    63.0    87.0
1    17.0    89.0    10.0
2    38.0    74.0    29.0
3    74.0    81.0    64.0
4    28.0    74.0    15.0
5     2.0    54.0    53.0
6    27.0    26.0    83.0
7    90.0    48.0    12.0
8     4.0    20.0    50.0
9    95.0    30.0    49.0

In [20]:
# info on data
data.describe()

          MarksA     MarksB     MarksC
count  10.000000  10.000000  10.000000
mean   39.900000  55.900000  45.200000
std    34.193729  24.383282  28.173273
min     2.000000  20.000000  10.000000
25%    18.750000  34.500000  18.500000
50%    27.500000  58.500000  49.500000
75%    65.000000  74.000000  61.250000
max    95.000000  89.000000  87.000000

In [21]:
data.tail()

   MarksA  MarksB  MarksC
5     2.0    54.0    53.0
6    27.0    26.0    83.0
7    90.0    48.0    12.0
8     4.0    20.0    50.0
9    95.0    30.0    49.0

### indexing

In [26]:
# indexing
# list
idx = [data.columns.get_loc('MarksB'),data.columns.get_loc('MarksC')]

In [27]:
data.iloc[:6,idx]

   MarksB  MarksC
0    63.0    87.0
1    89.0    10.0
2    74.0    29.0
3    81.0    64.0
4    74.0    15.0
5    54.0    53.0

In [28]:
data.iloc[6,idx]

MarksB    26.0
MarksC    83.0
Name: 6, dtype: float64

### sort data frame

In [29]:
data.sort_values(by=["MarksB","MarksA"],ascending=True)

   MarksA  MarksB  MarksC
8     4.0    20.0    50.0
6    27.0    26.0    83.0
9    95.0    30.0    49.0
7    90.0    48.0    12.0
5     2.0    54.0    53.0
0    24.0    63.0    87.0
4    28.0    74.0    15.0
2    38.0    74.0    29.0
3    74.0    81.0    64.0
1    17.0    89.0    10.0

### to numpy array

In [31]:
data.values.shape
data_val = data.values

### numpy array to data frame

In [32]:
data = pd.DataFrame(data_val,dtype="int32",columns=["Physics","Maths","Chem"])

In [33]:
data

   Physics  Maths  Chem
0       24     63    87
1       17     89    10
2       38     74    29
3       74     81    64
4       28     74    15
5        2     54    53
6       27     26    83
7       90     48    12
8        4     20    50
9       95     30    49

In [34]:
data.to_csv("marks.csv",index=False,header=False)